# Напишите функцию, которая принимает список my_list = [10, 20, 30, 40, 50] и возвращает их среднее значение.

# def calculate_madium_znach(numbers):
#     if len(numbers) == 0:
#         return 0  # Возвращаем 0 в случае пустого списка для избежания деления на ноль
#     summa = sum(numbers)
#     medium_znach = summa / len(numbers)
#     return medium_znach

# # Пример использования функции:
# my_list = [10, 20, 30, 40, 50]
# result = calculate_madium_znach(my_list)
# print("Среднее значение списка:", result)




# # Напишите функцию, которая принимает от пользователя список  и возвращает их среднее значение.

# def calculate_madium_znach(numbers):
#     if len(numbers) == 0:
#         return 0  # Возвращаем 0 в случае пустого списка для избежания деления на ноль
#     summa = sum(numbers)
#     medium_znach = summa / len(numbers)
#     return medium_znach


# my_list = []
# kol_numbers= int(input("Введите количество цифр в списке: "))
# for i in range(kol_numbers):
#     my_list.append(float(input("Введите значение из списка: ")))

# result = calculate_madium_znach(my_list)
# print("Среднее значение списка:", result)



# # Создайте функцию, которая принимает число и возвращает True, если число четное, и False, если число нечетное.
# # - Запроси у пользователя число
# # - Отправь его в функцию
# # - Если число четное - верни True
# # - Если число нечетное - верни False
# # - В зависимости от того, что вернулось функцией выведи результат: четное число или нет

# def is_even(number):
#     if number % 2 == 0:
#         return True
#     else:
#         return False

# # Пример использования функции:
# num = int(input("Введите число: "))
# if is_even(num):
#     print("Число четное")
# else:
#     print("Число нечетное")


