// Первый код: результат работы программы "Результат: 30"

#include <iostream>
using namespace std;
int main {
  int x y;
  x = 10;
  y = x 2;
  cout << "Результат " <<x + y;
return 0



// Второй код
// Результат работы программы

// Входные данные: 2 3
// Выходные данные: 5

// Входные данные: 10 1
// Выходные данные: 11

// Входные данные: 8 9
// Выходные данные: 17


#include <iostream>
using namespace std;
int main {
    int a b, c;
    cout << "Введите два числа: 
    cin >> a; b;
    c = a + b *; 
    cout << "Сумма чисел " << a + b + c
    return 0





