# x = [0,1,2,3,4,5,6,7,8,9]
# res = [0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
# x1 = x[1::2]
# x2 = x[-2::-2]

# count_x2 = 0
# count_x1 = 0
# for i in range(len(x)):
#     if i % 2 == 0:
#         res[i]=x2[count_x2]
#         count_x2+=1
#     else:
#         res[i]= x1[count_x1]
#         count_x1+=1
    
# # print(res)
# book = "Harry Potter"
# book2 = "Kolobok"
# book3 = "Rusalochka"
# print("За лето девочка прочитала ", book, "а затем ей в школе порекомендовали", book2, ". Она ее прочитала и \
#       захотела прочитать еще и ", book3)

# print(f"за лето девочка прочитала {book}, а затем ей в школе порекомендовали {book2}. Она ее прочитала и \
#       захотела прочитать еще и {book3}")



print("Моя любимая книга - 'Гарри Поттер'")
print('Моя любимая книга - "Гарри Поттер"')


print("Моя любимая книга - \"Гарри Поттер\" ")