# 💡 Домашнее задание:

# -Занести значения новых слов в словарик

# -Выполнить практику

# **Домашняя практика “Биография”**

# Запроси у пользователя следующую информацию:

# - Как зовут
# - Чем увлекается
# - Любимой блюдо
# - Отношение к программированию
# - И еще 2 вопроса придумай сам))

# Программа, узнав ответы на эти вопросы должна вывести в 
# консольное окно в виде:

# Тебя зовут …
# Ты увлекаешься ….
# Твое любимое блюдо…




name = input("Твое имя?")
age = input("Сколько тебе лет?")
hob = input("Чем увлекаешься?")
prog = input("Какое у тебя отношение к программированию?")
color = input("Какой твой любимый цвет?")
animal = input("Какое твое любимое животное?")

print("Тебя зовут " + name +"! Тебе " + age + " лет.")
print("Ты увлекаешься " + hob)
print("Твое отношение к программированию - " + prog)
print("Твое любимое животное " + animal)
print("Твой лбимый цвет " + color)
