# Посмотреть что можно переводить в какой-либо тип данных

# 1) Переменную а=”10” попробовать перевести в тип данных 
# int и float ( например, print(int(a)) )

# 2) Переменную a = “Hello” попробовать перевести в тип данных 
# int

# 3) Создать переменную b=99, попробовать перевести в тип данных 
# str, поменять значение на b=50.4, перевести в тип данных str, 
# поменять значение на b=True, перевести в тип данных str

# 4) Создать переменную c = 10, попробовать перевести в тип 
# данных True

#  Выполняй пункты постепенно, запуская код, если возникают 
# ошибки, то копируй ее и вставляй в поиск в интернете, если 
# ошибка возникает именно из-за условия задачи, то закомментируй 
# этот блок кода

# Сделай выводы относительно того, какие значения можно 
# переводить из одного типа данных в другой



a = '10'

print(int(a))
print(float(a))

a = 'Hello'
print(int(a))

b = 99
print(str(b))
b = 50.4
print(str(b))
b = True
print(str(b))

c = 10
print(bool(c))
